app/controllers/carts_controller.rb

  def show
    @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "6"]]

  def edit
    @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "6"]]

  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 30 Apr 2013 11:25:39 UTC +00:00], ["updated_at", Tue, 30 Apr 2013 11:25:39 UTC +00:00]]

  def update
    @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "6"]]

  def destroy
    @cart = Cart.find(params[:id])
    @cart.destroy
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 7]]