app/controllers/orders_controller.rb

    def new
        @cart = current_cart
        if @cart.line_items.empty?
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 1
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 1

    def edit
        @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "1"]]

    def create
        @order = Order.new(params[:order])
        @order.add_line_items_from_cart(current_cart)

        respond_to do |format|
            if @order.save
                Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 4]]

    def destroy
        @order = Order.find(params[:id])
        @order.destroy
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]